#include <iostream>
#include "Functions.h"

using namespace std;

int main()
{
	/*1. Написать функцию, которая получает указатель на мас-
	сив и его размер, и возвращает сумму и произведение его
	элементов в двух параметрах-ссылках.*/
	//int size, sum = 0;
	//long mult = 1;
	//cout << "Input the size of array: ";
	//cin >> size;
	//int *arr = new int[size];

	//cout << "\nArray: ";
	//initialShowArr(arr, size);
	//sumMult(arr, size, sum, mult);
	//cout << "\nThe sum of array: " << sum << ", the mult of array: " << mult << endl;

	/*2. Написать функцию, которая получает указатель на мас-
	сив и его размер, и возвращает количество отрицатель-
	ных, положительных и нулевых элементов массива, ис-
	пользуя механизм ссылок.*/

	//int size, neg = 0, zero = 0, pos = 0;
	//cout << "Input the size of array: ";
	//cin >> size;
	//int *arr = new int[size];

	//cout << "\nArray: ";
	//initialShowArr(arr, size);

	//sort(arr, size, neg, zero, pos);
	//cout << "\nThe count of neg: " << neg << ", the count of zero: " << zero << ", the count of pos: " << pos << endl;

	/*3. Написать функцию, которая получает указатель на дву-
	мерный массив и его размер, и возвращает среднее
	арифметическое элементов массива, а также количество
	чѐтных и нечѐтных элементов, используя механизм ссы-
	лок.*/
}