#include <iostream>
#include "Functions.h"

using namespace std;

int main()
{
	/*1. Написать функцию, которая получает указатель на мас-
	сив и его размер, и возвращает сумму и произведение его
	элементов в двух параметрах-ссылках.*/
	//int size, sum = 0;
	//long mult = 1;
	//cout << "Input the size of array: ";
	//cin >> size;
	//int *arr = new int[size];

	//cout << "\nArray: ";
	//initialShowArr(arr, size);
	//sumMult(arr, size, sum, mult);
	//cout << "\nThe sum of array: " << sum << ", the mult of array: " << mult << endl;
	//delete[] arr;

	/*2. Написать функцию, которая получает указатель на мас-
	сив и его размер, и возвращает количество отрицатель-
	ных, положительных и нулевых элементов массива, ис-
	пользуя механизм ссылок.*/

	//int size, neg = 0, zero = 0, pos = 0;
	//cout << "Input the size of array: ";
	//cin >> size;
	//int *arr = new int[size];

	//cout << "\nArray: ";
	//initialShowArr(arr, size);

	//sort(arr, size, neg, zero, pos);
	//cout << "\nThe count of neg: " << neg << ", the count of zero: " << zero << ", the count of pos: " << pos << endl;
	//delete[] arr;

	/*3. Написать функцию, которая получает указатель на дву-
	мерный массив и его размер, и возвращает среднее
	арифметическое элементов массива, а также количество
	чѐтных и нечѐтных элементов, используя механизм ссы-
	лок.*/

	//int fSize, sSize, avarage = 0, even = 0, odd = 0;
	//cout << "Input the first size of array: ";
	//cin >> fSize;
	//cout << "Input the second size of array: ";
	//cin >> sSize;
	//int **arr = new int* [fSize];

	//for (int i = 0; i < fSize; i++)
	//	arr[i] = new int[sSize];

	//cout << "\nArray: ";
	//initialArrTwoShow(arr, fSize, sSize);

	//avarageEvenOdd(arr, fSize, sSize, avarage, even, odd);
	//cout << "\n\nThe avarage is: " << avarage;
	//cout << "\nThe count of even number is: " << even;
	//cout << "\nThe count of odd number is: " << odd << endl;
	//delete[] arr;

	/*4. Написать следующие функции для работы с динамиче-
ским массивом:
a. функция распределения динамической памяти
b. функция инициализации динамического массива
c. функция печати динамического массива
d. функцию удаления динамического массива
e. функцию добавления элемента в конец массива
f. функцию вставки элемента по указанному индексу
g. функцию удаления элемента по указанному индексу*/

	
} 